package by.it_academy.less03.main;

public class LinearApps01 {  
	
	// Даны два действительных числа х и у. Вычислить их сумму, разность, произведение и частное

	public static void main(String[] args) {
		
		int x = 2;
		int y = 1;
		
		
		
		System.out.println("сумма = " + ( x + y ));
		System.out.println("разность = " + ( x - y ));
		System.out.println("произведение = " + ( x * y ));

	}

}
