package by.it_academy.less03.main;

public class LinearApps05 {
	
	public static void main(String[] args) {
		
		//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
		
		int a = 2;
		int b = a / 2;
		int S = a * b;
		
		System.out.println("Площадь прямоугольника: S = " + S);
		
	}

}
