package by.it_academy.less03.main;

public class LinearApps07 {

	public static void main(String[] args) {
		
		//Вычислить значение выражения по формуле (все переменные принимают действительные значения)
		
		double a = 1;
		double b = 1;
		double c = 1;
		double d = 1;
		double x;
		
		x = (( a / c ) * ( b / d )) - (((a * b)- c) / (c * d));
		
		System.out.println("x = " + x);

	}

}
